Repository: cygnus6960/freebsd-doc-ko
Catalog: documentation/content/*/books/handbook/filesystems/_index.po
Languages: es

source: This chapter shows the other filesystems supported by FreeBSD
es: Este capítulo muestra los otros sistemas de ficheros soportados por FreeBSD

source: Part III. System Administration
es: Parte III. Administración del sistema

source: Chapter 23. Other File Systems
es: Capítulo 23. Otros sistemas de archivos

source: Other File Systems
es: Otros sistemas de archivos

source: Synopsis
es: Sinopsis

source: File systems are an integral part of any operating system. They allow users to upload and store files, provide access to data, and make hard drives useful. Different operating systems differ in their native file system. Traditionally, the native FreeBSD file system has been the Unix File System UFS which has been modernized as UFS2. Since FreeBSD 7.0, the Z File System (ZFS) is also available as a native file system. See crossref:zfs[zfs,The Z File System (ZFS)] for more information.
es: Los sistemas de archivos son parte integrante de cualquier sistema operativo. Permiten a los usuarios cargar y almacenar archivos, proporcionan acceso a los datos y hacen que los discos duros sean útiles. Los distintos sistemas operativos difieren en su sistema de ficheros nativo. Tradicionalmente, el sistema de ficheros nativo de FreeBSD ha sido el Sistema de Ficheros Unix UFS que ha sido modernizado como UFS2. Desde FreeBSD 7.0, el Sistema de Ficheros Z (ZFS) también está disponible como sistema de ficheros nativo. Véase crossref:zfs[zfs,Sistema de archivos Z (ZFS)] para más información.

source: In addition to its native file systems, FreeBSD supports a multitude of other file systems so that data from other operating systems can be accessed locally, such as data stored on locally attached USB storage devices, flash drives, and hard disks. This includes support for the Linux(R) Extended File System (EXT).
es: Además de sus sistemas de ficheros nativos, FreeBSD soporta multitud de otros sistemas de ficheros para que pueda accederse localmente a datos de otros sistemas operativos, como datos almacenados en dispositivos de almacenamiento USB conectados localmente, unidades de memoria flash y discos duros. Esto incluye soporte para el sistema de ficheros extendido (EXT) de Linux(R).

source: There are different levels of FreeBSD support for the various file systems. Some require a kernel module to be loaded and others may require a toolset to be installed. Some non-native file system support is full read-write while others are read-only.
es: Existen diferentes niveles de soporte de FreeBSD para los distintos sistemas de ficheros. Algunos requieren que se cargue un módulo del kernel y otros pueden requerir que se instale un conjunto de herramientas. Algunos sistemas de ficheros no nativos son de lectura-escritura completa mientras que otros son de sólo lectura.

source: After reading this chapter, you will know:
es: Después de leer este capítulo, sabrás:

source: The difference between native and supported file systems.
es: Diferencia entre sistemas de archivos nativos y compatibles.

source: Which file systems are supported by FreeBSD.
es: Qué sistemas de ficheros soporta FreeBSD.

source: How to enable, configure, access, and make use of non-native file systems.
es: Cómo habilitar, configurar, acceder y hacer uso de sistemas de archivos no nativos.

source: Before reading this chapter, you should:
es: Antes de leer este capítulo, deberías:

source: Understand UNIX(R) and crossref:basics[basics,FreeBSD basics].
es: Comprender UNIX(R) y crossref:basics[conceptos básicos,conceptos básicos de FreeBSD].

source: Be familiar with the basics of crossref:kernelconfig[kernelconfig,kernel configuration and compilation].
es: Estar familiarizado con los conceptos básicos de crossref:kernelconfig[kernelconfig,configuración y compilación del núcleo].

source: Feel comfortable crossref:ports[ports,installing software] in FreeBSD.
es: Siéntase cómodo crossref:ports[ports,instalando software] en FreeBSD.

source: Have some familiarity with crossref:disks[disks,disks], storage, and device names in FreeBSD.
es: Estar familiarizado con crossref:disks[disks,disks], almacenamiento y nombres de dispositivos en FreeBSD.

source: Linux(R) File Systems
es: Sistemas de archivos Linux(R)

source: FreeBSD provides built-in support for several Linux(R) file systems. This section demonstrates how to load support for and how to mount the supported Linux(R) file systems.
es: FreeBSD proporciona soporte integrado para varios sistemas de ficheros Linux(R). Esta sección muestra cómo cargar y montar los sistemas de ficheros Linux(R) soportados.

source: Kernel support for ext2 file systems has been available since FreeBSD 2.2. The man:ext2fs[5] driver allows the FreeBSD kernel to both read and write to ext2, ext3, and ext4 file systems.
es: El soporte del kernel para sistemas de ficheros ext2 ha estado disponible desde FreeBSD 2.2. El controlador man:ext2fs[5] permite al kernel de FreeBSD leer y escribir en sistemas de ficheros ext2, ext3 y ext4.

source: Journalling and encryption are not supported yet.
es: Aún no se admiten el registro y la encriptación.

source: To access an ext file system, mount the ext volume by specifying its FreeBSD partition name and an existing mount point. This example mounts [.filename]#/dev/ada1s1# on [.filename]#/mnt#:
es: Para acceder a un sistema de ficheros ext, monte el volumen ext especificando su nombre de partición FreeBSD y un punto de montaje existente. Este ejemplo monta [.filename]#/dev/ada1s1# en [.filename]#/mnt#:
