Repository: cygnus6960/freebsd-doc-ko
Catalog: documentation/content/*/articles/leap-seconds/_index.po
Languages: pl

source: A short description of how leap seconds are handled on FreeBSD
pl: Krótki opis tego, jak obsługiwane są sekundy przestępne w FreeBSD

source: FreeBSD Support for Leap Seconds
pl: Wsparcie FreeBSD dla sekund przestępnych

source: Introduction
pl: Wprowadzenie

source: A _leap second_ is an one second adjustment made at specific times of year to UTC to synchronize atomic time scales with variations in the rotation of the Earth. This article describes how FreeBSD interacts with leap seconds.
pl: _Sekunda przestępna_ jest jednosekundową poprawką wprowadzaną w określonych porach roku do UTC, aby zsynchronizować atomowe skale czasu z różnicami w obrocie Ziemi. Ten artykuł opisuje jak FreeBSD obsługuje sekundy przestępne.

source: As of this writing, the next leap second will occur at 2015-Jun-30 23:59:60 UTC. This leap second will occur during a business day for North and South America and the Asia/Pacific region.
pl: Na dzień dzisiejszy, następna sekunda przestępna wystąpi w 2015-Jun-30 23:59:60 UTC. Ta sekunda przestępna wystąpi podczas dnia roboczego dla Ameryki Północnej i Południowej oraz regionu Azji i Pacyfiku.

source: Leap seconds are announced by https://www.iers.org/IERS/EN/Home/home_node.html[IERS] on https://datacenter.iers.org/data/latestVersion/16_BULLETIN_C16.txt[Bulletin C].
pl: Sekundy przestępne są ogłaszane przez https://www.iers.org/IERS/EN/Home/home_node.html[IERS] na stronie https://datacenter.iers.org/data/latestVersion/16_BULLETIN_C16.txt[Bulletin C].

source: Standard leap second behavior is described in https://datatracker.ietf.org/doc/html/rfc7164#section-3[RFC 7164]. Also see man:time2posix[3].
pl: Standardowe zachowanie sekund przestępnych jest opisane w https://datatracker.ietf.org/doc/html/rfc7164#section-3[RFC 7164]. Zobacz również man:time2posix[3].

source: Default Leap Second Handling on FreeBSD
pl: Domyślna obsługa sekund przestępnych na FreeBSD

source: The easiest way to handle leap seconds is with the POSIX time rules FreeBSD uses by default, combined with extref:{handbook}[NTP, network-ntp]. When man:ntpd[8] is running and the time is synchronized with upstream NTP servers that handle leap seconds correctly, the leap second will cause the system time to automatically repeat the last second of the day. No other adjustments are necessary.
pl: Najprostszym sposobem obsługi sekund przestępnych są domyślnie stosowane przez FreeBSD POSIX-owe reguły czasowe, połączone z extref:{handbook}[NTP, network-ntp]. Gdy man:ntpd[8] jest uruchomiony i czas jest synchronizowany z serwerami NTP, które poprawnie obsługują sekundy przestępne, sekunda przestępna spowoduje, że czas systemowy automatycznie powtórzy ostatnią sekundę dnia. Żadne inne regulacje nie są konieczne.

source: If the upstream NTP servers do not handle leap seconds correctly, man:ntpd[8] will step the time by one second after the errant upstream server has noticed and stepped itself.
pl: Jeśli serwery NTP nie obsługują poprawnie sekund przestępnych, man:ntpd[8] będzie przesuwał czas o jedną sekundę po tym, jak błędny serwer strumienia wysyłowego zauważy i przesunie się sam.

source: If NTP is not being used, manual adjustment of the system clock will be required after the leap second has passed.
pl: Jeśli NTP nie jest używany, po upływie sekundy przestępnej wymagana będzie ręczna regulacja zegara systemowego.

source: Cautions
pl: Ostrzeżenia

source: Leap seconds are inserted at the same instant all over the world: UTC midnight. In Japan that is mid-morning, in the Pacific mid-day, in the Americas late afternoon, and in Europe at night.
pl: Sekundy przestępne są wstawiane w tym samym momencie na całym świecie: O północy UTC. W Japonii jest to środek poranka, na Pacyfiku środek dnia, w obu Amerykach późne popołudnie, a w Europie noc.

source: We believe and expect that FreeBSD, if provided correct and stable NTP service, will work as designed during this leap second, as it did during the previous ones.
pl: Wierzymy i oczekujemy, że FreeBSD, jeśli zapewnimy mu poprawną i stabilną usługę NTP, będzie działał zgodnie z założeniami przy kolejnych sekundach przestępnych, tak jak podczas poprzednich.

source: However, we caution that practically no applications have ever asked the kernel about leap seconds. Our experience is that, as designed, leap seconds are essentially a replay of the second before the leap second, and this is a surprise to most application programmers.
pl: Jednakże, ostrzegamy, że praktycznie żadna aplikacja nigdy nie pytała jądra o sekundy przestępne. Z naszego doświadczenia wynika, że zgodnie z projektem, sekundy przestępne są zasadniczo powtórzeniem sekundy przed sekundą przestępną, a to jest niespodzianką dla większości programistów aplikacji.

source: Other operating systems and other computers may or may not handle the leap-second the same way as FreeBSD, and systems without correct and stable NTP service will not know anything about leap seconds at all.
pl: Inne systemy operacyjne i inne komputery mogą, ale nie muszą obsługiwać sekund przestępnych w taki sam sposób jak FreeBSD, a systemy bez poprawnej i stabilnej usługi NTP w ogóle nie będą wiedziały nic o sekundach przestępnych.

source: It is not unheard of for computers to crash because of leap seconds, and experience has shown that a large fraction of all public NTP servers might handle and announce the leap second incorrectly.
pl: Nie jest niczym niezwykłym, że komputery ulegają awarii z powodu sekund przestępnych, a doświadczenie pokazuje, że duża część wszystkich publicznych serwerów NTP może obsługiwać i ogłaszać sekundy przestępne w sposób nieprawidłowy.

source: Please try to make sure nothing horrible happens because of the leap second.
pl: Proszę starać się, aby nic strasznego nie stało się z powodu sekundy przestępnej.

source: Testing
pl: Testowanie

source: It is possible to test whether a leap second will be used. Due to the nature of NTP, the test might work up to 24 hours before the leap second. Some major reference clock sources only announce leap seconds one hour ahead of the event. Query the NTP daemon:
pl: Możliwe jest przetestowanie, czy zostanie użyta sekunda przestępna. Z powodu natury NTP, test może działać do 24 godzin przed sekundą przestępną. Niektóre główne źródła zegarów referencyjnych ogłaszają sekundy przestępne tylko na godzinę przed wydarzeniem. Zadaj pytanie demonowi NTP:

source: Output that includes `leap_add_sec` indicates proper support of the leap second. Before the 24 hours leading up to the leap second, or after the leap second has passed, `leap_none` will be shown.
pl: Wyjście zawierające `leap_add_sec` wskazuje na prawidłowe wsparcie sekundy przestępnej. Przed upływem 24 godzin poprzedzających sekundę przestępną, lub po jej upływie, pokazane zostanie `leap_none`.

source: Conclusion
pl: Podsumowanie

source: In practice, leap seconds are usually not a problem on FreeBSD. We hope that this overview helps clarify what to expect and how to make the leap second event proceed more smoothly.
pl: W praktyce, sekundy przestępne zazwyczaj nie stanowią problemu na FreeBSD. Mamy nadzieję, że ten zarys pomoże wyjaśnić, czego można się spodziewać i jak sprawić, aby sekunda przestępna przebiegła bardziej płynnie.
