Repository: cygnus6960/freebsd-doc-ko
Catalog: documentation/content/*/articles/freebsd-releng/_index.po
Languages: es

source: Update the `BRANCH` value to reflect `CURRENT`, and increment `REVISION`
es: Actualiza el valor de `BRANCH` para que muestre el valor `CURRENT` e incrementa `REVISION`

source: Update `TARGET_TRIPLE` and `MACHINE_TRIPLE`
es: Actualiza `TARGET_TRIPLE` y `MACHINE_TRIPLE`

source: Update `__FreeBSD_version`
es: Actualiza `__FreeBSD_version`

source: Update `FBSD_MAJOR` and `FBSD_CC_VER`
es: Actualiza `FBSD_MAJOR` y `FBSD_CC_VER`

source: Append the `freebsdversion.h` section
es: Añade la sección `freebsdversion.h`

source: Update the value of `OS_VERSION`
es: Actualiza el valor de `OS_VERSION`

source: Update `FREEBSD_CC_VERSION`
es: Actualiza `FREEBSD_CC_VERSION`

source: Update `LLD_REVISION_STRING`
es: Actualiza `LLD_REVISION_STRING`

source: Update `LIB32CPUFLAGS`
es: Actualiza `LIB32CPUFLAGS`

source: Release from {branchStable}
es: Versiones desde {branchStable}

source: This section describes the general procedures of the FreeBSD release cycle from an extablished {branchStable} branch.
es: Esta sección describe los procedimientos generales del ciclo de lanzamiento de FreeBSD desde una rama {branchStable} establecida.

source: FreeBSD `stable` Branch Code Slush
es: Code Sluch de la Rama FreeBSD `stable`

source: In preparation for the code freeze on a `stable` branch, several files need to be updated to reflect the release cycle is officially in progress. These files are all relative to the top-most level of the stable branch:
es: En preparación para la congelación del código en una rama `estable`, varios archivos deben ser actualizados para reflejar que el ciclo de liberación está oficialmente en curso. Estos archivos son todos relativos al nivel más alto de la rama estable:

source: Update the `BRANCH` value to reflect `PRERELEASE`
es: Actualiza el valor de `BRANCH` para que muestre `PRERELEASE`

source: Update `TARGET_TRIPLE`
es: Actualiza `TARGET_TRIPLE`

source: Update `OS_VERSION`
es: Actualiza `OS_VERSION`

source: FreeBSD `BETA` Builds
es: Construcciones FreeBSD `BETA`

source: There are two general exceptions to requiring commit approval during the release cycle. The first is any change that needs to be committed by the Release Engineer to proceed with the day-to-day workflow of the release cycle, the other is security fixes that may occur during the release cycle.
es: Hay dos excepciones, las cuales no requieren la aprobación del commit. La primera es cualquier cambio que deba realizar el Ingeniero de Lanzamientos para continuar con el flujo de trabajo diario del ciclo de lanzamientos, y el segundo, son las correcciones de errores de seguridad que puedan ocurrir durante el ciclo de lanzamientos.

source: Once the code freeze is in effect, the next build from the branch is labeled `BETA1`. This is done by updating the `BRANCH` value in [.filename]#sys/conf/newvers.sh# from `PRERELEASE` to `BETA1`.
es: Una vez que la congelación de código tiene efecto, la siguiente construcción de la rama se etiqueta como `BETA1`. Esto se hace actualizando el valor `BRANCH` en [.filename]#sys/conf/newvers.sh# de `PRERELEASE` a `BETA1`.

source: Once this is done, the first set of `BETA` builds are started. Subsequent `BETA` builds do not require updates to any files other than [.filename]#sys/conf/newvers.sh#, incrementing the `BETA` build number.
es: Una vez hecho esto, se comienza la construcción del primer conjunto `BETA`. Las construcciones `BETA` subsiguientes no requieren más actualización que la del fichero [.filename]#sys/conf/newvers.sh#, incrementando el número de construcción `BETA`.

source: Creating the {branchRelengx} Branch
es: Creando la Rama {branchRelengx}

source: When the first `RC` (Release Candidate) build is ready to begin, the {branchReleng} branch is created. This is a multi-step process that must be done in a specific order, to avoid anomalies such as overlaps with `__FreeBSD_version` values, for example. The paths listed below are relative to the repository root. The order of commits and what to change are:
es: Cuando la primera construcción `RC` (Release Candidate) está lista para comenzar, se crea la rama {branchRelengx}. Este es un proceso de varios pasos que se tiene que realizar en un orden específico, para evitar anomalías como el solapado de valores de `__FreeBSD_version`, por ejemplo. Las rutas mostradas abajo son relativas a la raíz del repositorio. El orden de los commits y lo que hay que cambiar es el siguiente:

source: Change `BETA__X__` to `RC1`
es: Cambia `BETA__X__` a `RC1`

source: Move `REPRODUCIBLE_BUILD` from `__DEFAULT_NO_OPTIONS` to `__DEFAULT_YES_OPTIONS`
es: Cambia `REPRODUCIBLE_BUILD` de `__DEFAULT_NO_OPTIONS` a `__DEFAULT_YES_OPTIONS`

source: Replace `latest` with `quarterly` as the default package repository location
es: Sustituye `latest` con `quarterly` para la localización por defecto del repositorio de paquetes

source: Update `BETA__X__` with `PRERELEASE`
es: Actualiza `BETA__X__` con `PRERELEASE`

source: Now that two new `__FreeBSD_version` values exist, also update [.filename]#~/documentation/content/en/books/porters-handbook/versions/chapter.adoc# in the Documentation Project repository.
es: Ahora que ya existe el nuevo valor de `__FreeBSD_version`, actualiza también [.filename]#~/documentation/content/en/books/porters-handbook/versions/chapter.adoc# en el repositorio del Proyecto de Documentación.

source: Following the availability of the first `RC`, {teamBugmeister} should be emailed to add the new FreeBSD `-RELEASE` to the `versions` available in the drop-down menu shown in the bug tracker.
es: Cuando la primera `RC` esté disponible, se debería enviar un correo a {teamBugmeister} para añadir la nueva `-RELEASE` de FreeBSD a las `versiones` disponibles en el menú desplegable que se muestra en el gestor de bugs.

source: Building FreeBSD Installation Media
es: Construir los Medios de Instalación de FreeBSD

source: This section describes the general procedures producing FreeBSD development snapshots and releases.
es: Esta sección describe los procedimientos generales que producen instantáneas y versiones del desarrollo de FreeBSD.

source: Release Build Scripts
es: Scripts de Construcción de Versiones

source: Prior to FreeBSD 9.0-RELEASE, [.filename]#src/release/Makefile# was updated to support , and the [.filename]#src/release/generate-release.sh# script was introduced as a wrapper to automate invoking the targets.
es: Antes de la versión FreeBSD 9.0-RELEASE, se actualizó [.filename]#src/release/Makefile# para soportar, y el script [.filename]#src/release/generate-release.sh# fue introducido como un envoltorio, para automatizar la invocación de los distintos objetivos.

source: Prior to FreeBSD 9.2-RELEASE, [.filename]#src/release/release.sh# was introduced, which heavily based on [.filename]#src/release/generate-release.sh# included support to specify configuration files to override various options and environment variables. Support for configuration files provided support for cross building each architecture for a release by specifying a separate configuration file for each invocation.
es: Antes de FreeBSD 9.2-RELEASE, se introdujo [.filename]#src/release/release.sh#, que basado en gran medida en [.filename]#src/release/generate-release.sh# incluía soporte para especificar archivos de configuración para anular varias opciones y variables de entorno. El soporte para los archivos de configuración proporcionaba soporte para construir de forma cruzada cada arquitectura para una versión especificando un archivo de configuración separado para cada invocación.

source: As a brief example of using [.filename]#src/release/release.sh# to build a single release in [.filename]#/scratch#:
es: Un pequeño ejemplo de cómo usar [.filename]#src/release/release.sh# para construir una única versión en [.filename]#/scratch#:

source: As a brief example of using [.filename]#src/release/release.sh# to build a single, cross-built release using a different target directory, create a custom [.filename]#release.conf# containing:
es: Un breve ejemplo del uso de [.filename]#src/release/release.sh# para construir una única versión cruzada utilizando un directorio de destino diferente, cree un [.filename]#release.conf# personalizado que contenga:

source: Then invoke [.filename]#src/release/release.sh# as:
es: Después invoca [.filename]#src/release/release.sh# así:

source: See and [.filename]#src/release/release.conf.sample# for more details and example usage.
es: Echa un vistazo a [.filename]#src/release/release.conf.sample# para más detalles y ejemplos de uso.

source: Building FreeBSD Releases
es: Construyendo Versiones de FreeBSD

source: During the release cycle, a copy of [.filename]#CHECKSUM.SHA512# and [.filename]#CHECKSUM.SHA256# for each architecture are stored in the {teamRe} internal repository in addition to being included in the various announcement emails. Each [.filename]#MANIFEST# containing the hashes of [.filename]#base.txz#, [.filename]#kernel.txz#, etc. are added to package:misc/freebsd-release-manifests[] in the Ports Collection, as well.
es: Durante el ciclo de lanzamiento, se almacena una copia de [.filename]#CHECKSUM.SHA512# y [.filename]#CHECKSUM.SHA256# para cada arquitectura en el repositorio interno de {teamRe} además de ser incluido en varios correos electrónicos de anuncio. Cada [.filename]#MANIFEST# que contiene los hashes de [.filename]#base.txz#, [.filename]#kernel.txz#, etc. es añadido también a package:misc/freebsd-release-manifests[] en la Colección de Ports.

source: In preparation for the release build, several files need to be updated:
es: En preparación para la construcción de la liberación, varios archivos necesitan ser actualizados:

source: Update the `BRANCH` value to `RELEASE`
es: Actualiza el valor de `BRANCH` a `RELEASE`

source: Add the anticipated announcement date
es: Añade la fecha prevista del anuncio

source: Replace `__FreeBSD_version` with the value in [.filename]#sys/sys/param.h#
es: Reemplaza `__FreeBSD_version` con el valor del fichero [.filename]#sys/sys/param.h#

source: Publishing FreeBSD Installation Media to Project Mirrors
es: Publicar los Medios de Instalación de FreeBSD para los Mirrors del Proyecto

source: This section describes the procedure to publish FreeBSD development snapshots and releases to the Project mirrors.
es: Esta sección describe el procedimiento para publicar instantáneas del desarrollo de FreeBSD y las versiones en los mirrors del Proyecto.

source: Staging FreeBSD Installation Media Images
es: Puesta en marcha las Imágenes de los Medios de Instalación de FreeBSD

source: Staging FreeBSD snapshots and releases is a two part process:
es: La puesta en marcha de las instantáneas y lanzamientos de FreeBSD es un proceso de dos partes:

source: Creating the directory structure to match the hierarchy on `ftp-master`
es: Crear la estructura de directorios que concuerda con la jerarquía en `ftp-master`

source: If `EVERYTHINGISFINE` is defined in the build configuration files, [.filename]#main.conf# in the case of the build scripts referenced above, this happens automatically in the after the build is complete, creating the directory structure in [.filename]#${DESTDIR}/R/ftp-stage# with a path structure matching what is expected on `ftp-master`. This is equivalent to running the following in the directly:
es: Si `EVERYTHINGISFINE` está definida en los ficheros de configuración de la construcción, [.filename]#main.conf# en el caso de los scripts de construcción referenciados arriba, esto sucede automáticamente después de que se haya completado la construcción, creando la estructura de directorios en [.filename]#${DESTDIR}/R/ftp-stage# con una estructura de rutas que concuerda con lo que se espera en `ftp-master`. Esto es equivalente a ejecutar directamente lo siguiente:

source: After each architecture is built, [.filename]#thermite.sh# will rsync the [.filename]#${DESTDIR}/R/ftp-stage# from the build to [.filename]#/snap/ftp/snapshots# or [.filename]#/snap/ftp/releases# on the build host, respectively.
es: Después de que se haya construido cada arquitectura, [.filename]#thermite.sh# sincronizará con rsync el [.filename]#${DESTDIR}/R/ftp-stage# de la construcción a [.filename]#/snap/ftp/snapshots# o [.filename]#/snap/ftp/releases# en la máquina de construcción, respectivamente.

source: Copying the files to a staging directory on `ftp-master` before moving the files into [.filename]#pub/# to begin propagation to the Project mirrors
es: Copiar los ficheros a un directorio de preparación en `ftp-master` antes de mover los ficheros a [.filename]#pub/# para comenzar la propagación a los mirrors del Proyecto

source: Once all builds have finished, [.filename]#/snap/ftp/snapshots#, or [.filename]#/snap/ftp/releases# for a release, is polled by `ftp-master` using rsync to [.filename]#/archive/tmp/snapshots# or [.filename]#/archive/tmp/releases#, respectively.
es: Una vez que todas las construcciones han terminado, [.filename]#/snap/ftp/snapshots#, o [.filename]#/snap/ftp/releases# para una release, es consultado por `ftp-master` utilizando rsync para [.filename]#/archive/tmp/snapshots# o [.filename]#/archive/tmp/releases#, respectivamente.

source: On `ftp-master` in the FreeBSD Project infrastructure, this step requires `root` level access, as this step must be executed as the `archive` user.
es: En `ftp-master` en la infraestructura del Proyecto FreeBSD, este proceso necesita nivel de acceso `root`, ya que este paso debe ejecutarse como el usuario `archive`.

source: Publishing FreeBSD Installation Media
es: Publicación de los Medios de Instalación de FreeBSD

source: Once the images are staged in [.filename]#/archive/tmp/#, they are ready to be made public by putting them in [.filename]#/archive/pub/FreeBSD#. To reduce propagation time, is used to create hard links from [.filename]#/archive/tmp# to [.filename]#/archive/pub/FreeBSD#.
es: Una vez que las imágenes están preparadas en [.filename]#/archive/tmp/#, están listas para ser publicadas poniéndolas en [.filename]#/archive/pub/FreeBSD#. Para reducir el tiempo de propagación se crean enlaces desde [.filename]#/archive/tmp# a [.filename]#/archive/pub/FreeBSD#.

source: For this to be effective, both [.filename]#/archive/tmp# and [.filename]#/archive/pub# must reside on the same logical filesystem.
es: Para que esto sea efectivo, tanto [.filename]#/archive/tmp# como [.filename]#/archive/pub# deben estar en el mismo sistema de ficheros lógico.

source: There is a caveat, however, where rsync must be used after to correct the symbolic links in [.filename]#pub/FreeBSD/snapshots/ISO-IMAGES# which will replace with a hard link, increasing the propagation time.
es: Hay un problema, sin embargo, donde se debe usar rsync después para corregir los enlaces simbólicos en [.filename]#pub/FreeBSD/snapshots/ISO-IMAGES# que serán reemplazados con enlaces duros, incrementando el tiempo de propagación.

source: As with the staging steps, this requires `root` level access, as this step must be executed as the `archive` user.
es: Al igual que con los pasos de preparación, este requiere acceso nivel `root` ya que este paso debe ser ejecutado como el usuario `archive`.

source: As the `archive` user:
es: Como usuario `archive`:

source: Replace _snapshots_ with _releases_ as appropriate.
es: Reemplaza _snapshots_ con _releases_ donde corresponda.

source: Wrapping up the Release Cycle
es: Cerrando el Ciclo de Liberación

source: This section describes general post-release tasks.
es: En esta sección se describen las tareas generales posteriores a la liberación.

source: Post-Release Errata Notices
es: Notificaciones de Errores Posteriores a la Liberación

source: As the release cycle approaches conclusion, it is common to have several EN (Errata Notice) candidates to address issues that were discovered late in the cycle. Following the release, the {teamRe} and the {teamSecteam} revisit changes that were not approved prior to the final release, and depending on the scope of the change in question, may issue an EN.
es: Según se acerca el final del ciclo de liberación, es común tener varios EN candidatos (Errata Notice) para tratar problemas que han sido descubiertos tarde en el ciclo. Después de la release, el {teamRe} y el {teamSecteam} revisan cambios que no fueron aprobados antes de la release final, y dependiendo del alcance del cambio en cuestión, podría crear una EN.

source: The actual process of issuing ENs is handled by the {teamSecteam}.
es: El proceso de creación de ENs es manejado por el {teamSecteam}.

source: To request an Errata Notice after a release cycle has completed, a developer should fill out the https://www.freebsd.org/security/errata-template.txt[Errata Notice template], in particular the `Background`, `Problem Description`, `Impact`, and if applicable, `Workaround` sections.
es: Para solicitar una Errata Notice después de que el ciclo de liberación haya finalizado, un desarrollador debería rellenar el https://www.freebsd.org/security/errata-template.txt[Errata Notice template], en concreto las secciones `Background`, `Problem Description`, `Impact`, y `Workaround` si es aplicable.

source: The completed Errata Notice template should be emailed together with either a patch against the {branchReleng} branch or a list of revisions from the {branchStable} branch.
es: La plantilla completa de la Errata Notice se debería enviar junto con un parche contra {branchReleng} o una lista de revisiones de la rama {branchStable}.

source: For Errata Notice requests immediately following the release, the request should be emailed to both the {teamRe} and the {teamSecteam}. Once the {branchReleng} branch has been handed over to the {teamSecteam} as described in <<releng-wrapup-handoff>>, Errata Notice requests should be sent to the {teamSecteam}.
es: Para peticiones de Errata Notice que sean inmediatamente posteriores a la release, la petición debería ser enviada por correo electrónico al {teamRe} y al {teamSecteam}. Una vez que la rama {branchReleng} ha sido entregada al {teamSecteam} como se describe en <<releng-wrapup-handoff>>, las peticiones de Errata Notice deberían ser enviadas al {teamSecteam}.

source: Handoff to the {teamSecteam}
es: Entrega al {teamSecteam}

source: Release End-of-Life
es: Fin del ciclo de Vida de la Versión

source: This section describes the website-related files to update when a release reaches EoL (End-of-Life).
es: Esta sección describe los ficheros que hay que actualizar en el sitio web cuando una versión alcanza su EoL (End-of-Life).

source: Website Updates for End-of-Life
es: Actualizaciones del Sitio Web para End-Of-Life

source: When a release reaches End-of-Life, references to that release should be removed and/or updated on the website:
es: Cuando un lanzamiento llega al final de su vida, las referencias a ese lanzamiento deben ser eliminadas y/o actualizadas en el sitio web:

source: File
es: Fichero

source: Remove `u-relXXX-announce` and `u-relXXX-announce` references.
es: Elimina las referencias a `u-relXXX-announce` y `u-relXXX-announce`.

source: Move the `u-relXXX-*` variables from the supported release list to the Legacy Releases list.
es: Mueve las variables `u-relXXX-*` desde la lista de versiones soportadas a la lista de versiones obsoletas (Legacy Releases).

source: Remove the branch from the supported branch list.
es: Elimina la rama de la lista de ramas soportadas.

source: Remove the URLs for the release.
es: Elimina las URLs para la release.

source: Remove references to the release and releng branch.
es: Elimina las referencias a las ramas de release y releng.
