Repository: cygnus6960/freebsd-doc-ko
Catalog: documentation/content/*/articles/freebsd-releng/_index.po
Languages: es

source: Describes the approach used by the FreeBSD release engineering team to make production quality releases of the FreeBSD Operating System. It describes the tools available for those interested in producing customized FreeBSD releases for corporate rollouts or commercial productization
es: Describe la aproximación utilizada por el equipo de ingeniería de versiones de FreeBSD para producir versiones de calidad de producción del Sistema Operativo FreeBSD. Describe las herramientas disponibles para aquellos que estén interesados en producir versiones personalizadas de FreeBSD para lanzamientos corporativos o productos comerciales

source: FreeBSD Release Engineering
es: Ingeniería de versiones de FreeBSD

source: Abstract
es: Resumen

source: This article describes the release engineering process of the FreeBSD Project.
es: Este artículo describe el proceso detrás del modelo de ingeniería de versiones adoptado por el Proyecto FreeBSD.

source: Introduction to the FreeBSD Release Engineering Process
es: Introducción al Proceso de Ingeniería de Versiones de FreeBSD

source: Development of FreeBSD has a very specific workflow. In general, all changes to the FreeBSD base system are committed to the {branchHead} branch, which reflects the top of the source tree.
es: El desarrollo de FreeBSD tiene un flujo de trabajo muy específico. En general, todos los cambios en el sistema base de FreeBSD se hacen en la rama {branchHead}, que representa la cima del árbol de fuentes.

source: After a reasonable testing period, changes can then be merged to the {branchStable} branches. The default minimum timeframe before merging to {branchStable} branches is three (3) days.
es: Después de un periodo de pruebas razonable, los cambios se pueden integrar en las ramas {branchStable}. El tiempo mínimo por defecto para integrar cambios en las ramas {branchStable} es de tres (3) días.

source: Although a general rule to wait a minimum of three days before merging from {branchHead}, there are a few special circumstances where an immediate merge may be necessary, such as a critical security fix, or a bug fix that directly inhibits the release build process.
es: A pesar de la regla general de esperar un mínimo de tres días antes de integrar cambios desde {branchHead}, hay algunas circunstancias especiales bajo las cuales una integración inmediata puede ser necesaria, como arreglos críticos de seguridad, o un arreglo de un fallo que directamente imposibilita el proceso de generación de versiones.

source: After several months, and the number of changes in the {branchStable} branch have grown significantly, it is time to release the next version of FreeBSD. These releases have been historically referred to as "point" releases.
es: Después de varios meses, y de que el número de cambios en la rama {branchStable} haya crecido significativamente, es hora de liberar la siguiente versión de FreeBSD. Estas versiones han sido denominadas históricamente como versiones punto ("point" releases).

source: In between releases from the {branchStable} branches, approximately every two (2) years, a release will be cut directly from {branchHead}. These releases have been historically referred to as "dot-zero" releases.
es: Entre las versiones de las ramas {branchStable}, aproximadamente cada dos (2) años, se sacará una versión directamente desde {branchHead}. Estas versiones se han denominado históricamente como versiones "punto cero" ("dot-zero" releases).

source: This article will highlight the workflow and responsibilities of the {teamRe} for both "dot-zero" and "point"' releases.
es: Este artículo resaltará el flujo de trabajo y responsabilidades del {teamRe} tanto para las versiones "dot-zero" como las versiones "point".

source: The following sections of this article describe:
es: Las siguientes secciones de este artículo describen:

source: General information and preparation before starting the release cycle.
es: Información general y preparación antes de comenzar el ciclo de lanzamiento.

source: Website Changes During the Release Cycle
es: Cambios en el Sitio Web Durante el Ciclo de Liberación

source: Terminology and general information, such as the "code slush" and "code freeze", used throughout this document.
es: Terminología e información general, tales como "code slush" y "code freeze", usados en este documento.

source: The Release Engineering process for a "dot-zero" release.
es: El proceso de Ingeniería de Versiones para una versión "dot-zero".

source: The Release Engineering process for a "point" release.
es: El proceso de Ingeniería de Versiones para una versión "point".

source: Information related to the specific procedures to build installation medium.
es: Información relacionada con los procedimientos específicos para construir el medio de instalación.

source: Procedures to publish installation medium.
es: Procedimientos para publicar un medio de instalación.

source: Wrapping up the release cycle.
es: Terminando el ciclo de lanzamiento.

source: General Information and Preparation
es: Información General y Preparación

source: Approximately two months before the start of the release cycle, the {teamRe} decides on a schedule for the release. The schedule includes the various milestone points of the release cycle, such as freeze dates, branch dates, and build dates. For example:
es: Aproximadamente dos meses antes del ciclo de lanzamiento, el {teamRe} decide una programación para la versión. La programación incluye varios hitos en el ciclo de lanzamiento como fechas de congelación, fechas para ramificación y fechas para construcción. Por ejemplo:

source: Milestone
es: Hito

source: Anticipated Date
es: Fecha Esperada

source: Ports quarterly branch [2]:
es: Rama trimestral de ports [2]:

source: {branchStablex} branch:
es: rama {branchStablex}:

source: BETA1 build starts:
es: Comienzo de la construcción de BETA1:

source: BETA2 build starts:
es: Comienzo de la construcción de BETA2:

source: BETA3 build starts [*]:
es: Comienzo de la construcción de BETA3 [*]:

source: {branchRelengx} branch:
es: rama {branchRelengx}:

source: RC1 build starts:
es: Comienzo de la construcción de RC1:

source: {branchStablex} thaw:
es: rama {branchStablex} thaw:

source: RC2 build starts:
es: Comienzo de la construcción de RC2:

source: Final Ports package builds [4]:
es: Construcción final de paquetes de Ports [4]:

source: Ports release tag:
es: Etiqueta de versión de Ports:

source: August 12, 2016
es: 12 de agosto de 2016

source: RC3 build starts [*]:
es: Comienzo de la construcción de RC3 [*]:

source: RELEASE build starts:
es: Comienzo de la construcción de RELEASE:

source: RELEASE announcement:
es: Anuncio de RELEASE:

source: Items marked with "[*]" are "as needed".
es: Los elementos marcados con "[*]" identifican los pasos realizados solo "cuando sean necesarios".

source: The `doc/` tree slush is coordinated by the {teamDoceng}.
es: El "slush" (semi congelación) del árbol `doc/` está coordinado por el {teamDoceng}.

source: The Ports quarterly branch used is determined by when the final `RC` build is planned. A new quarterly branch is created on the first day of the quarter, so this metric should be used when taking the release cycle milestones into account. The quarterly branch is created by the {teamPortmgr}.
es: La rama trimestral de Ports que va a ser utilizada se determina por el momento en el que se planifica la construcción de la `RC` final. Una nueva rama trimestral es creada el primer día del trimestre, por lo que se debería usar esta métrica cuando se consideren los hitos del ciclo de lanzamiento. La rama trimestral es creada por el {teamPortmgr}.

source: The `doc/` tree is tagged by the {teamDoceng}.
es: El árbol `doc/` es etiquetado por el {teamDoceng}.

source: The final Ports package build is done by the {teamPortmgr} after the final (or what is expected to be final) `RC` build.
es: La construcción final de los paquetes de Ports es realizada por el {teamPortmgr} después de la construcción `RC` definitiva (o lo que se espera que sea la definitiva).

source: If the release is being created from an existing {branchStable} branch, the KBI freeze date can be excluded, since the KBI is already considered frozen on established {branchStable} branches.
es: Si la versión se está creando a partir de una rama {branchStable} existente, la fecha de congelación del KBI (Kernel Binary Interface) se puede excluir, ya que el KBI ya se considera congelado en ramas {branchStable} establecidas.

source: When writing the release cycle schedule, a number of things need to be taken into consideration, in particular milestones where the target date depends on predefined milestones upon which there is a dependency. For example, the Ports Collection release tag originates from the active quarterly branch at the time of the last `RC`. This in part defines which quarterly branch is used, when the release tag can happen, and what revision of the ports tree is used for the final `RELEASE` build.
es: Al escribir el programa del ciclo de lanzamientos, se deben tener en cuenta varias cosas, en particular, los hitos en los que la fecha objetivo depende de los hitos predefinidos de los que exista una dependencia. Por ejemplo, la etiqueta de la Colección de Ports se obtiene de la rama trimestral que esté activa en el momento de la última fase `RC`. Esto, en parte, define qué rama trimestral se usa, cuándo se puede realizar la etiqueta y qué revisión del árbol de ports se usa para la compilación final de `RELEASE`.

source: After general agreement on the schedule, the {teamRe} emails the schedule to the FreeBSD Developers.
es: Después de un acuerdo general sobre la programación, el {teamRe} envía un correo electrónico con la programación a los Desarrolladores de FreeBSD.

source: It is somewhat typical that many developers will inform the {teamRe} about various works-in-progress. In some cases, an extension for the in-progress work will be requested, and in other cases, a request for "blanket approval" to a particular subset of the tree will be made.
es: Es algo típico que muchos desarrolladores informen al {teamRe} sobre varios trabajos en curso. En algunos casos, se solicitará una extensión del trabajo en curso y en otros casos, se hará una petición de "blanket approval" (aprobación total) para un subconjunto particular del árbol.

source: When such requests are made, it is important to make sure timelines (even if estimated) are discussed. For blanket approvals, the length of time for the blanket approval should be made clear. For example, a FreeBSD developer may request blanket approvals from the start of the code slush until the start of the `RC` builds.
es: Cuando se hacen tales solicitudes, es importante asegurarse de que se discutan los plazos (incluso si se estiman). Para las aprobaciones generales, el período de tiempo para la aprobación general debe quedar claro. Por ejemplo, un desarrollador de FreeBSD puede solicitar una aprobación general desde el principio del slush del código hasta el inicio de la compilación de la `RC`.

source: To keep track of blanket approvals, the {teamRe} uses an internal repository to keep a running log of such requests, which defines the area upon which a blanket approval was granted, the author(s), when the blanket approval expires, and the reason the approval was granted. One example of this is granting blanket approval to [.filename]#release/doc/# to all {teamRe} members until the final `RC` to update the release notes and other release-related documentation.
es: Para realizar el seguimiento de los "blanket approvals", el {teamRe} usa un repositorio interno para mantener un registro de esas peticiones, el cual define el área sobre la que se aprueba el "blanket approval", los autores, cuando expira la aprobación y la razón por la que fue concedido. Un ejemplo de esto es aprobar "blanket approval" para [.filename]#release/doc/# para todos los miembros de {teamRe} hasta la `RC` definitiva con el fin de actualizar las notas de la versión y otra documentación relacionada con ella.

source: The {teamRe} also uses this repository to track pending approval requests that are received just prior to starting various builds during the release cycle, which the Release Engineer specifies the cutoff period with an email to the FreeBSD developers.
es: El equipo de ingeniería de versiones de FreeBSD también utiliza este repositorio para rastrear las solicitudes de aprobación pendientes que se reciben justo antes de empezar el ciclo de compilaciones del lanzamiento, que el Ingeniero de Lanzamientos especifica el período límite con un correo electrónico a los desarrolladores de FreeBSD.

source: Depending on the underlying set of code in question, and the overall impact the set of code has on FreeBSD as a whole, such requests may be approved or denied by the {teamRe}.
es: Dependiendo del conjunto de código que haya por debajo y el impacto tal que el conjunto de código tienen en FreeBSD como un todo, esas peticiones pueden ser aprobadas o denegadas por el {teamRe}.

source: The same applies to work-in-progress extensions. For example, in-progress work for a new device driver that is otherwise isolated from the rest of the tree may be granted an extension. A new scheduler, however, may not be feasible, especially if such dramatic changes do not exist in another branch.
es: Lo mismo se aplica al trabajo que haya en progreso. Por ejemplo, en el caso del desarrollo de un nuevo controlador, el cual está aislado del resto del árbol del código fuente, podría tener una extensión de tiempo. Sin embargo, en el caso de un nuevo planificador de procesos, puede no ser viable, en especial si los cambios no están en otra rama.

source: The schedule is also added to the Project website, in the `doc/` repository, in [.filename]#~/website/content/en/releases/{branchRevision}R/schedule.adoc#. This file is continuously updated as the release cycle progresses.
es: El programa también se añade a la página web del Proyecto, en el repositorio `doc/`, en [.filename]#~/website/content/en/releases/{branchRevision}R/schedule.adoc#. Este fichero se actualiza continuamente según progresa el ciclo de lanzamiento.

source: In most cases, the [.filename]#schedule.adoc# can be copied from a prior release and updated accordingly.
es: La mayor parte de las veces, el fichero [.filename]#schedule.adoc# se puede copiar de una versión anterior y actualizarlo como corresponda.

source: In addition to adding [.filename]#schedule.adoc# to the website, [.filename]#~/shared/releases.adoc# is also updated to add the link to the schedule to various subpages, as well as enabling the link to the schedule on the Project website index page.
es: Además de añadir [.filename]#schedule.adoc# al sitio web, también se actualiza [.filename]#~/shared/releases.adoc# para añadir el enlace al programa a las distintas subpáginas, así como habilitar el enlace al programa en la página índice del sitio web del Proyecto.

source: The schedule is also linked from [.filename]#~/website/content/en/releng/_index.adoc#.
es: El programa también se enlaza desde [.filename]#~/website/content/en/releng/_index.adoc#.

source: Approximately one month prior to the scheduled "code slush", the {teamRe} sends a reminder email to the FreeBSD Developers.
es: Aproximadamente un mes antes del "code slush" planificado, el {teamRe} envía un correo electrónico recordatorio a los Desarrolladores de FreeBSD.

source: Release Engineering Terminology
es: Terminología de la Ingeniería de Versiones

source: This section describes some of the terminology used throughout the rest of this document.
es: Esta sección describe parte de la terminología utilizada en el resto de este documento.

source: The Code Slush
es: El Code Slush

source: Although the code slush is not a hard freeze on the tree, the {teamRe} requests that bugs in the existing code base take priority over new features.
es: Aunque el code slush no es una congelación completa del árbol, el {teamRe} solicita que los fallos existentes en el código base tengan prioridad sobre las nuevas características.

source: The code slush does not enforce commit approvals to the branch.
es: El code slush no impone aprobaciones en los commits a la rama.

source: The Code Freeze
es: La Congelación del Código

source: The code freeze marks the point in time where all commits to the branch require explicit approval from the {teamRe}.
es: La congelación del código marca el punto en el tiempo en el que todos los commits a la rama requieren una aprobación explícita por parte del {teamRe}.

source: During the code freeze, FreeBSD committers are urged to follow the link:https://wiki.freebsd.org/Releng/ChangeRequestGuidelines[Change Request Guidelines].
es: Durante la congelación de código, se insta a los committers de FreeBSD a seguir las link:https://wiki.freebsd.org/Releng/ChangeRequestGuidelines[Change Request Guidelines].

source: The KBI/KPI Freeze
es: La Congelación del KBI/KPI

source: KBI/KPI stability implies that the caller of a function across two different releases of software that implement the function results in the same end state. The caller, whether it is a process, thread, or function, expects the function to operate in a certain way, otherwise the KBI/KPI stability on the branch is broken.
es: La estabilidad de KBI/KPI implica que llamar a una función a través de dos versiones de software diferentes den el mismo resultado. Quien llama, ya sea un proceso, un subproceso o una función, espera que la función se comporte de cierta forma, de lo contrario, la estabilidad de KBI/KPI en la rama se ve afectada.

source: This section describes the changes to the website that should occur as the release cycle progresses.
es: Esta sección describe los cambios que deberían de ocurrir en el sitio web a medida que avanza el ciclo de lanzamiento.

source: Website Changes Before the Release Cycle Begins
es: Cambios en el Sitio Web Antes de que Empiece el Ciclo de Lanzamiento

source: File to Edit
es: Fichero a Editar

source: What to Change
es: Qué Cambiar

source: Change `beta-upcoming` from `IGNORE` to `INCLUDE`
es: Cambia `beta-upcoming` de `IGNORE` a `INCLUDE`

source: Change `beta-testing` from `IGNORE` to `INCLUDE`
es: Cambia `beta-testing` de `IGNORE` a `INCLUDE`

source: Website Changes During `BETA` or `RC`
es: Cambios del Sitio Web Durante `BETA` o `RC`

source: When transitioning from `PRERELEASE` to `BETA`, these files need to be updated to enable the "Help Test" block on the download page. All files are relative to [.filename]#head/# in the `doc` repository:
es: Cuando se transita de `PRERELEASE` a `BETA`, estos ficheros necesitan ser actualizados para habilitar el bloque "Help Test" en la página de descargas. Todos los ficheros son relativos a [.filename]#head/# en el repositorio `doc`:

source: Update `betarel-vers` to `BETA__1__`
es: Actualiza `betarel-vers` a `BETA__1__`

source: Add an entry announcing the `BETA`
es: Añade una entrada anunciando la `BETA`

source: Add the new `BETA`, `RC`, or final `RELEASE` to the template
es: Añade la nueva `BETA`, `RC` o `RELEASE` final a la plantilla

source: The relevant release-related documents exist in the [.filename]#doc# repository for FreeBSD 12.x and later.
es: Los documentos relevantes relacionados con una versión están en el repositorio [.filename]#doc# para FreeBSD 12.x y posteriores.

source: Ports Changes During `BETA`, `RC`, and the Final `RELEASE`
es: Cambios en los Ports durante `BETA`, `RC`, y la `RELEASE` Final

source: For each build during the release cycle, the `MANIFEST` files containing the `SHA256` of the various distribution sets, such as `base.txz`, `kernel.txz`, and so on, are added to the package:misc/freebsd-release-manifests[] port. This allows utilities other than , such as package:ports-mgmt/poudriere[], to safely use these distribution sets by providing a mechanism through which the checksums can be verified.
es: Para cada construcción durante el ciclo de lanzamiento, los ficheros `MANIFEST` que contienen el `SHA256` de los distintos conjuntos de distribuciones, como `base.txz`, `kernel.txz` y demás son añadidos al port package:misc/freebsd-release-manifests[]. Esto permite a otras utilidades, como package:ports-mgmt/poudriere[], utilizar estos conjuntos de distribuciones de forma segura al proporcionar un mecanismo mediante el cual verificar los checksums.

source: Release from {branchHead}
es: Versiones desde {branchHead}

source: This section describes the general procedures of the FreeBSD release cycle from the {branchHead} branch.
es: Esta sección describe los procedimientos generales del ciclo de lanzamiento de FreeBSD desde la rama {branchHead}.

source: FreeBSD "`ALPHA`" Builds
es: Construcciones FreeBSD "`ALPHA`"

source: Starting with the FreeBSD 10.0-RELEASE cycle, the notion of "`ALPHA`" builds was introduced. Unlike the `BETA` and `RC` builds, `ALPHA` builds are not included in the FreeBSD Release schedule.
es: El concepto de construcción "`ALPHA`" se introdujo en el ciclo de FreeBSD 10.0-RELASE. A diferencia de las construcciones `BETA` y `RC`, las construcciones `ALPHA` no están incluidas en la programación de lanzamientos de FreeBSD.

source: The idea behind `ALPHA` builds is to provide regular FreeBSD-provided builds before the creation of the {branchStable} branch.
es: La idea detrás de las construcciones `ALPHA` es proporcionar construcciones regulares de FreeBSD antes de la creación de la rama {branchStable}.

source: FreeBSD `ALPHA` snapshots should be built approximately once a week.
es: Las instantáneas FreeBSD `ALPHA` se deberían construir aproximadamente una vez a la semana.

source: For the first `ALPHA` build, the `BRANCH` value in [.filename]#sys/conf/newvers.sh# needs to be changed from `CURRENT` to `ALPHA1`. For subsequent `ALPHA` builds, increment each `ALPHA__N__` value by one.
es: Para la primera construcción `ALPHA`, el valor `BRANCH` en [.filename]#sys/conf/newvers.sh# tiene que cambiarse de `CURRENT` a `ALPHA1`. Para las siguientes construcciones `ALPHA`, incrementa cada valor `ALPHA__N__` en uno.

source: See <<releng-building>> for information on building the `ALPHA` images.
es: Visita <<releng-building>> para obtener información acerca de cómo construir imágenes `ALPHA`.

source: Creating the {branchStablex} Branch
es: Creando la Rama {branchStablex}

source: Update the FreeBSD version, and remove the notice about `WITNESS`
es: Actualiza la versión de FreeBSD y elimina el aviso acerca de `WITNESS`

source: Uncomment `-DNDEBUG`
es: Descomenta `-DNDEBUG`

source: Remove debugging support
es: Elimina el soporte para depuración

source: Update `SRCBRANCH`
es: Actualiza `SRCBRANCH`

source: Remove these kernel configurations
es: Elimina estas configuraciones del kernel

source: Remove debugging options
es: Elimina las opciones de depuración

source: Update the `BRANCH` value to reflect `BETA1`
es: Actualiza el valor de `BRANCH` a `BETA1`

source: Move `REPRODUCIBLE_BUILD` from `\__DEFAULT_NO_OPTIONS` to `__DEFAULT_YES_OPTIONS`
es: Mueve `REPRODUCIBLE_BUILD` de `\__DEFAULT_NO_OPTIONS` a `__DEFAULT_YES_OPTIONS`

source: Set `dumpdev` from `AUTO` to `NO` (it is configurable via for those that want it enabled by default)
es: Cambia `dumpdev` de `AUTO` a `NO` (es configurable para aquellos que lo quieren activado por defecto)

source: Remove the `debug.witness.trace` entries
es: Elimina las entradas `debug.witness.trace`

source: Then in the {branchHead} branch, which will now become a new major version:
es: Después, en la rama {branchHead} , que se convertirá en una nueva versión mayor:

source: Update the FreeBSD version
es: Actualiza la versión de FreeBSD
