Repository: cygnus6960/freebsd-doc-ko
Catalog: documentation/content/*/articles/bsdl-gpl/_index.po
Languages: pl

source: The GPL explicitly disallows revoking the license. It has occurred, however, that a company (Mattel) purchased a GPL copyright (cphack), revoked the entire copyright, went to court, and prevailed <<two>>. That is, they legally revoked the entire distribution and all derivative works based on the copyright. Whether this could happen with a larger and more dispersed distribution is an open question; there is also some confusion regarding whether the software was really under the GPL.
pl: GPL wyraźnie zabrania unieważniania licencji. Zdarzyło się jednak, że firma (Mattel) kupiła prawa autorskie GPL (cphack), unieważniła całe prawo autorskie, poszła do sądu i wygrała <<two>>. To znaczy, legalnie odwołali całą dystrybucję i wszystkie prace pochodne oparte na prawach autorskich. Czy mogłoby się to zdarzyć w przypadku większej i bardziej rozproszonej dystrybucji, jest kwestią otwartą; istnieje również pewne zamieszanie dotyczące tego, czy oprogramowanie było rzeczywiście na licencji GPL.

source: In another example, Red Hat purchased Cygnus, an engineering company that had taken over development of the FSF compiler tools. Cygnus was able to do so because they had developed a business model in which they sold support for GNU software. This enabled them to employ some 50 engineers and drive the direction of the programs by contributing the preponderance of modifications. As Donald Rosenberg states "projects using licenses like the GPL...live under constant threat of having someone take over the project by producing a better version of the code and doing it faster than the original owners." <<three>>
pl: Innym przykładem jest zakup przez Red Hat firmy inżynierskiej Cygnus, która przejęła rozwój narzędzi kompilacyjnych FSF. Cygnus był w stanie to zrobić, ponieważ rozwinął model biznesowy, w którym sprzedawał wsparcie dla oprogramowania GNU. To pozwoliło im zatrudnić około 50 inżynierów i kierować kierunkiem rozwoju programów poprzez wnoszenie większości modyfikacji. Jak twierdzi Donald Rosenberg, "projekty używające licencji takich jak GPL... żyją pod ciągłym zagrożeniem, że ktoś przejmie projekt, produkując lepszą wersję kodu i robiąc to szybciej niż pierwotni właściciele". <<three>>

source: GPL Advantages and Disadvantages
pl: Zalety i wady GPL

source: A common reason to use the GPL is when modifying or extending the gcc compiler. This is particularly apt when working with one-off specialty CPUs in environments where all software costs are likely to be considered overhead, with minimal expectations that others will use the resulting compiler.
pl: Częstym powodem używania GPL jest modyfikacja lub rozszerzanie kompilatora gcc. Jest to szczególnie trafne w przypadku pracy z jednorazowymi, specjalistycznymi procesorami w środowiskach, gdzie wszystkie koszty oprogramowania są prawdopodobnie traktowane jako koszty ogólne, z minimalnymi oczekiwaniami, że inni będą używać powstałego kompilatora.

source: The GPL is also attractive to small companies selling CDs in an environment where "buy-low, sell-high" may still give the end-user a very inexpensive product. It is also attractive to companies that expect to survive by providing various forms of technical support, including documentation, for the GPLed intellectual property world.
pl: GPL jest również atrakcyjna dla małych firm sprzedających płyty CD w środowisku, w którym "buy-low, sell-high" może nadal dawać użytkownikowi końcowemu bardzo tani produkt. Jest ona również atrakcyjna dla firm, które spodziewają się przetrwać dzięki dostarczaniu różnych form wsparcia technicznego, w tym dokumentacji, dla świata własności intelektualnej objętej licencją GPL.

source: A less publicized and unintended use of the GPL is that it is very favorable to large companies that want to undercut software companies. In other words, the GPL is well suited for use as a marketing weapon, potentially reducing overall economic benefit and contributing to monopolistic behavior.
pl: Mniej nagłośnionym i niezamierzonym zastosowaniem GPL jest to, że jest ona bardzo korzystna dla dużych firm, które chcą podcinać ceny oprogramowania. Innymi słowy, GPL dobrze nadaje się do wykorzystania jako broń marketingowa, potencjalnie zmniejszająca ogólne korzyści ekonomiczne i przyczyniająca się do zachowań monopolistycznych.

source: The GPL can present a real problem for those wishing to commercialize and profit from software. For example, the GPL adds to the difficulty a graduate student will have in directly forming a company to commercialize his research results, or the difficulty a student will have in joining a company on the assumption that a promising research project will be commercialized.
pl: GPL może stanowić prawdziwy problem dla tych, którzy chcą komercjalizować i czerpać zyski z oprogramowania. Na przykład, GPL zwiększa trudność, jaką będzie miał student, by bezpośrednio założyć firmę w celu komercjalizacji wyników swoich badań, lub trudność, jaką będzie miał student, by dołączyć do firmy, zakładając, że obiecujący projekt badawczy zostanie skomercjalizowany.

source: For those who must work with statically-linked implementations of multiple software standards, the GPL is often a poor license, because it precludes using proprietary implementations of the standards. The GPL thus minimizes the number of programs that can be built using a GPLed standard. The GPL was intended to not provide a mechanism to develop a standard on which one engineers proprietary products. (This does not apply to Linux applications because they do not statically link, rather they use a trap-based API.)
pl: Dla tych, którzy muszą pracować ze statycznie powiązanymi implementacjami wielu standardów oprogramowania, GPL jest często słabą licencją, ponieważ wyklucza użycie własnościowych implementacji standardów. W ten sposób GPL minimalizuje liczbę programów, które mogą być zbudowane z wykorzystaniem standardu. GPL miała w zamierzeniu nie stanowić mechanizmu do tworzenia standardu, na którym można konstruować własnościowe produkty. (Nie dotyczy to aplikacji linuksowych, ponieważ nie łączą się one statycznie, a raczej używają API opartego na pułapkach).

source: The GPL attempts to make programmers contribute to an evolving suite of programs, then to compete in the distribution and support of this suite. This situation is unrealistic for many required core system standards, which may be applied in widely varying environments which require commercial customization or integration with legacy standards under existing (non-GPL) licenses. Real-time systems are often statically linked, so the GPL and LGPL are definitely considered potential problems by many embedded systems companies.
pl: GPL próbuje zmusić programistów do współtworzenia rozwijającego się zestawu programów, a następnie do konkurowania w dystrybucji i wspieraniu tego zestawu. Taka sytuacja jest nierealistyczna dla wielu wymaganych podstawowych standardów systemowych, które mogą być stosowane w bardzo różnych środowiskach, które wymagają komercyjnego dostosowania lub integracji ze starszymi standardami na istniejących (nie-GPL) licencjach. Systemy czasu rzeczywistego są często statycznie powiązane, więc GPL i LGPL są zdecydowanie uważane za potencjalne problemy przez wiele firm zajmujących się systemami embedded.

source: The GPL is an attempt to keep efforts, regardless of demand, at the research and development stages. This maximizes the benefits to researchers and developers, at an unknown cost to those who would benefit from wider distribution.
pl: GPL jest próbą utrzymania wysiłków, niezależnie od zapotrzebowania, na etapie badań i rozwoju. Maksymalizuje to korzyści dla badaczy i twórców, przy nieznanym koszcie dla tych, którzy skorzystaliby z szerszej dystrybucji.

source: The GPL was designed to keep research results from transitioning to proprietary products. This step is often assumed to be the last step in the traditional technology transfer pipeline and it is usually difficult enough under the best of circumstances; the GPL was intended to make it impossible.
pl: GPL została stworzona po to, aby wyniki badań nie przechodziły do produktów zastrzeżonych. Często zakłada się, że ten etap jest ostatnim krokiem w tradycyjnym procesie transferu technologii i w najlepszych okolicznościach jest on wystarczająco trudny; GPL miała go uniemożliwić.

source: BSD Advantages
pl: Zalety BSD

source: A BSD style license is a good choice for long duration research or other projects that need a development environment that:
pl: Licencja w stylu BSD jest dobrym wyborem dla długotrwałych badań lub innych projektów wymagających środowiska programistycznego, które:

source: has near zero cost
pl: ma prawie zerowy koszt

source: will evolve over a long period of time
pl: będzie ewoluować przez długi okres czasu

source: permits anyone to retain the option of commercializing final results with minimal legal issues.
pl: pozwala każdemu zachować możliwość komercjalizacji wyników końcowych przy minimalnych problemach prawnych.

source: This final consideration may often be the dominant one, as it was when the Apache project decided upon its license:
pl: Ten ostatni czynnik może być często dominujący, tak jak to było w przypadku projektu Apache, gdy decydowano o jego licencji:

source: "This type of license is ideal for promoting the use of a reference body of code that implements a protocol for common service. This is another reason why we choose it for the Apache group - many of us wanted to see HTTP survive and become a true multiparty standard, and would not have minded in the slightest if Microsoft or Netscape choose to incorporate our HTTP engine or any other component of our code into their products, if it helped further the goal of keeping HTTP common... All this means that, strategically speaking, the project needs to maintain sufficient momentum, and that participants realize greater value by contributing their code to the project, even code that would have had value if kept proprietary."
pl: "Ten typ licencji jest idealny do promowania wykorzystania referencyjnego ciała kodu, które implementuje protokół dla wspólnej usługi. Jest to kolejny powód, dla którego wybraliśmy ją dla grupy Apache - wielu z nas chciało, by HTTP przetrwał i stał się prawdziwym wielostronnym standardem, i nie miałoby najmniejszego problemu, gdyby Microsoft czy Netscape zdecydowały się włączyć nasz silnik HTTP lub jakikolwiek inny składnik naszego kodu do swoich produktów, jeśli pomogłoby to w realizacji celu, jakim jest utrzymanie powszechności HTTP... Wszystko to oznacza, że strategicznie rzecz biorąc, projekt musi utrzymać odpowiedni rozmach, a uczestnicy realizują większą wartość, wnosząc swój kod do projektu, nawet kod, który miałby wartość, gdyby pozostał zastrzeżony."

source: Developers tend to find the BSD license attractive as it keeps legal issues out of the way and lets them do whatever they want with the code. In contrast, those who expect primarily to use a system rather than program it, or expect others to evolve the code, or who do not expect to make a living from their work associated with the system (such as government employees), find the GPL attractive, because it forces code developed by others to be given to them and keeps their employer from retaining copyright and thus potentially "burying" or orphaning the software. If you want to force your competitors to help you, the GPL is attractive.
pl: Programiści zwykle uważają licencję BSD za atrakcyjną, ponieważ nie porusza ona kwestii prawnych i pozwala im robić z kodem co tylko zechcą. Z kolei ci, którzy oczekują, że będą przede wszystkim używać systemu, a nie go programować, lub oczekują, że inni będą rozwijać kod, albo nie oczekują, że będą się utrzymywać z pracy związanej z systemem (jak np. pracownicy rządowi), uznają licencję GPL za atrakcyjną, ponieważ zmusza ona do przekazania im kodu stworzonego przez innych i powstrzymuje pracodawcę przed zachowaniem praw autorskich, a tym samym potencjalnym "zakopaniem" lub osieroceniem oprogramowania. Jeśli chcecie zmusić swoich konkurentów do pomocy, GPL jest atrakcyjna.

source: A BSD license is not simply a gift. The question "why should we help our competitors or let them steal our work?" comes up often in relation to a BSD license. Under a BSD license, if one company came to dominate a product niche that others considered strategic, the other companies can, with minimal effort, form a mini-consortium aimed at reestablishing parity by contributing to a competitive BSD variant that increases market competition and fairness. This permits each company to believe that it will be able to profit from some advantage it can provide, while also contributing to economic flexibility and efficiency. The more rapidly and easily the cooperating members can do this, the more successful they will be. A BSD license is essentially a minimally complicated license that enables such behavior.
pl: Licencja BSD nie jest po prostu prezentem. Pytanie "dlaczego mielibyśmy pomagać naszym konkurentom lub pozwolić im na kradzież naszej pracy?" pojawia się często w odniesieniu do licencji BSD. W ramach licencji BSD, jeżeli jedna firma zdominowała niszę produktową, którą inni uznali za strategiczną, pozostałe firmy mogą, przy minimalnym wysiłku, utworzyć mini-konsorcjum mające na celu przywrócenie parytetu poprzez wniesienie wkładu do konkurencyjnego wariantu BSD, który zwiększa konkurencję rynkową i sprawiedliwość. Pozwala to każdej firmie wierzyć, że będzie mogła skorzystać z jakiejś przewagi, którą może zapewnić, a jednocześnie przyczynia się do elastyczności i efektywności ekonomicznej. Im szybciej i łatwiej współpracujący członkowie mogą to zrobić, tym większy będzie ich sukces. Licencja BSD jest w zasadzie minimalnie skomplikowaną licencją, która umożliwia takie zachowanie.

source: A key effect of the GPL, making a complete and competitive Open Source system widely available at cost of media, is a reasonable goal. A BSD style license, in conjunction with ad-hoc-consortiums of individuals, can achieve this goal without destroying the economic assumptions built around the deployment-end of the technology transfer pipeline.
pl: Kluczowy efekt GPL, czyli uczynienie kompletnego i konkurencyjnego systemu otwartego oprogramowania szeroko dostępnym po kosztach nośnika, jest rozsądnym celem. Licencja w stylu BSD, w połączeniu z doraźnymi konsorcjami osób fizycznych, może osiągnąć ten cel bez niszczenia założeń ekonomicznych zbudowanych wokół wdrożeniowego końca łańcucha transferu technologii.

source: Specific Recommendations for using a BSD license
pl: Szczególne zalecenia dotyczące stosowania licencji BSD

source: The BSD license is preferable for transferring research results in a way that will widely be deployed and most benefit an economy. As such, research funding agencies, such as the NSF, ONR and DARPA, should encourage in the earliest phases of funded research projects, the adoption of BSD style licenses for software, data, results, and open hardware. They should also encourage formation of standards based around implemented Open Source systems and ongoing Open Source projects.
pl: Licencja BSD jest lepsza do przekazywania wyników badań w sposób, który będzie szeroko stosowany i przyniesie największe korzyści gospodarce. W związku z tym agencje finansujące badania, takie jak NSF, ONR i DARPA, powinny zachęcać w najwcześniejszych fazach finansowanych projektów badawczych do przyjęcia licencji typu BSD dla oprogramowania, danych, wyników i otwartego sprzętu. Powinny również zachęcać do tworzenia standardów opartych na wdrożonych systemach otwartego oprogramowania i trwających projektach otwartego oprogramowania.

source: Government policy should minimize the costs and difficulties in moving from research to deployment. When possible, grants should require results to be available under a commercialization friendly BSD style license.
pl: Polityka rządu powinna minimalizować koszty i trudności związane z przejściem od badań do wdrożenia. Jeśli to możliwe, dotacje powinny wymagać, aby wyniki były dostępne na przyjaznej dla komercjalizacji licencji typu BSD.

source: In many cases, the long-term results of a BSD style license more accurately reflect the goals proclaimed in the research charter of universities than what occurs when results are copyrighted or patented and subject to proprietary university licensing. Anecdotal evidence exists that universities are financially better rewarded in the long run by releasing research results and then appealing to donations from commercially successful alumni.
pl: W wielu przypadkach długoterminowe rezultaty licencji w stylu BSD dokładniej odzwierciedlają cele głoszone w karcie badawczej uniwersytetów niż to, co dzieje się, gdy wyniki są chronione prawem autorskim lub patentem i podlegają prawnie zastrzeżonym licencjom uniwersyteckim. Istnieją anegdotyczne dowody na to, że uniwersytety są finansowo lepiej wynagradzane w dłuższej perspektywie poprzez ujawnianie wyników badań, a następnie odwoływanie się do darowizn od absolwentów, którzy odnieśli sukces komercyjny.

source: Companies have long recognized that the creation of de facto standards is a key marketing technique. The BSD license serves this role well, if a company really has a unique advantage in evolving the system. The license is legally attractive to the widest audience while the company's expertise ensures their control. There are times when the GPL may be the appropriate vehicle for an attempt to create such a standard, especially when attempting to undermine or co-opt others. The GPL, however, penalizes the evolution of that standard, because it promotes a suite rather than a commercially applicable standard. Use of such a suite constantly raises commercialization and legal issues. It may not be possible to mix standards when some are under the GPL and others are not. A true technical standard should not mandate exclusion of other standards for non-technical reasons.
pl: Firmy od dawna uznały, że tworzenie standardów de facto jest kluczową techniką marketingową. Licencja BSD dobrze spełnia tę rolę, jeśli firma rzeczywiście ma unikalną przewagę w rozwijaniu systemu. Licencja jest prawnie atrakcyjna dla najszerszej publiczności, a doświadczenie firmy zapewnia jej kontrolę. Są sytuacje, w których GPL może być odpowiednim narzędziem do próby stworzenia takiego standardu, zwłaszcza gdy próbuje się podważyć lub wchłaniać innych. GPL jednak szkodzi ewolucji tego standardu, ponieważ promuje pakiet, a nie komercyjnie stosowany standard. Używanie takiego pakietu stale rodzi problemy komercyjne i prawne. Może nie być możliwe mieszanie standardów, gdy niektóre z nich są na licencji GPL, a inne nie. Prawdziwy standard techniczny nie powinien nakazać wykluczenia innych standardów z powodów nietechnicznych.

source: Companies interested in promoting an evolving standard, which can become the core of other companies' commercial products, should be wary of the GPL. Regardless of the license used, the resulting software will usually devolve to whoever actually makes the majority of the engineering changes and most understands the state of the system. The GPL simply adds more legal friction to the result.
pl: Firmy zainteresowane promowaniem rozwijającego się standardu, który może stać się podstawą komercyjnych produktów innych firm, powinny wystrzegać się licencji GPL. Niezależnie od użytej licencji, powstałe w jej wyniku oprogramowanie zwykle przechodzi w ręce tego, kto faktycznie wprowadza większość zmian inżynieryjnych i najlepiej rozumie stan systemu. GPL po prostu dodaje więcej tarć prawnych do wyniku.

source: Large companies, in which Open Source code is developed, should be aware that programmers appreciate Open Source because it leaves the software available to the employee when they change employers. Some companies encourage this behavior as an employment perk, especially when the software involved is not directly strategic. It is, in effect, a front-loaded retirement benefit with potential lost opportunity costs but no direct costs. Encouraging employees to work for peer acclaim outside the company is a cheap portable benefit a company can sometimes provide with near zero downside.
pl: Duże firmy, w których rozwijany jest kod otwartego oprogramowania, powinny mieć świadomość, że programiści cenią sobie otwarte oprogramowanie, ponieważ pozostawia ono pracownikowi dostęp do oprogramowania, gdy ten zmieni pracodawcę. Niektóre firmy zachęcają do takiego zachowania jako bonusu, zwłaszcza gdy oprogramowanie nie jest bezpośrednio strategiczne. Jest to, w efekcie, świadczenie emerytalne z potencjalnymi kosztami utraconych możliwości, ale bez kosztów bezpośrednich. Zachęcanie pracowników do pracy dla rówieśników spoza firmy jest tanim, przenośnym benefitem, który firma może czasem zapewnić z niemal zerowym minusem.

source: Small companies with software projects vulnerable to orphaning should attempt to use the BSD license when possible. Companies of all sizes should consider forming such Open Source projects when it is to their mutual advantage to maintain the minimal legal and organization overheads associated with a true BSD-style Open Source project.
pl: Małe firmy, których projekty oprogramowania są narażone na osierocenie, powinny starać się używać licencji BSD, kiedy tylko jest to możliwe. Firmy każdej wielkości powinny rozważyć utworzenie takich projektów otwartego oprogramowania, gdy jest to korzystne dla nich obu, aby utrzymać minimalne koszty prawne i organizacyjne związane z prawdziwym projektem otwartego oprogramowania w stylu BSD.

source: Non-profits should participate in Open Source projects when possible. To minimize software engineering problems, such as mixing code under different licenses, BSD-style licenses should be encouraged. Being leery of the GPL should particularly be the case with non-profits that interact with the developing world. In some locales where application of law becomes a costly exercise, the simplicity of the new BSD license, as compared to the GPL, may be of considerable advantage.
pl: Organizacje non-profit powinny uczestniczyć w projektach opartych na otwartym oprogramowaniu, kiedy tylko jest to możliwe. Aby zminimalizować problemy związane z inżynierią oprogramowania, takie jak mieszanie kodu na różnych licencjach, powinno się zachęcać do stosowania licencji typu BSD. Niechęć do licencji GPL powinna dotyczyć szczególnie organizacji pozarządowych, które współpracują z krajami rozwijającymi się. W niektórych miejscach, gdzie stosowanie prawa staje się kosztowne, prostota nowej licencji BSD w porównaniu z GPL może przynieść znaczne korzyści.

source: Conclusion
pl: Podsumowanie

source: In contrast to the GPL, which is designed to prevent the proprietary commercialization of Open Source code, the BSD license places minimal restrictions on future behavior. This allows BSD code to remain Open Source or become integrated into commercial solutions, as a project's or company's needs change. In other words, the BSD license does not become a legal time-bomb at any point in the development process.
pl: W przeciwieństwie do licencji GPL, której celem jest uniemożliwienie komercjalizacji kodu otwartego oprogramowania, licencja BSD nakłada minimalne ograniczenia na przyszłe zachowania. Dzięki temu kod BSD może pozostać kodem otwartego oprogramowania lub zostać włączony do rozwiązań komercyjnych, w miarę jak zmieniają się potrzeby projektu lub firmy. Innymi słowy, licencja BSD nie staje się prawną bombą zegarową w żadnym momencie procesu rozwoju.
