Repository: cygnus6960/freebsd-doc-ko
Catalog: documentation/content/*/articles/bsdl-gpl/_index.po
Languages: pl

source: Why you should use a BSD style license for your Open Source Project
pl: Dlaczego powinieneś używać licencji w stylu BSD dla swojego projektu Open Source

source: Introduction
pl: Wprowadzenie

source: This document makes a case for using a BSD style license for software and data; specifically it recommends using a BSD style license in place of the GPL. It can also be read as a BSD versus GPL Open Source License introduction and summary.
pl: Ten dokument przedstawia argumenty za używaniem licencji w stylu BSD dla oprogramowania i danych; w szczególności zaleca używanie licencji w stylu BSD zamiast GPL. Może być również czytany jako wprowadzenie i podsumowanie licencji otwartego oprogramowania BSD kontra GPL.

source: Very Brief Open Source History
pl: Bardzo krótka historia otwartego oprogramowania

source: Long before the term "Open Source" was used, software was developed by loose associations of programmers and freely exchanged. Starting in the early 1950's, organizations such as http://www.share.org[SHARE] and http://www.decus.org[DECUS] developed much of the software that computer hardware companies bundled with their hardware offerings. At that time computer companies were in the hardware business; anything that reduced software cost and made more programs available made the hardware companies more competitive.
pl: Na długo przed użyciem terminu otwarte oprogramowanie, programy były tworzone przez luźne stowarzyszenia programistów i swobodnie wymieniane. Począwszy od wczesnych lat pięćdziesiątych, organizacje takie jak http://www.share.org[SHARE] i http://www.decus.org[DECUS] opracowały większość oprogramowania, które firmy produkujące sprzęt komputerowy dołączały do swoich ofert. W tamtym czasie firmy komputerowe zajmowały się sprzętem komputerowym; wszystko, co zmniejszało koszty oprogramowania i sprawiało, że więcej programów było dostępnych, czyniło firmy sprzętowe bardziej konkurencyjnymi.

source: This model changed in the 1960's. In 1965 ADR developed the first licensed software product independent of a hardware company. ADR was competing against a free IBM package originally developed by IBM customers. ADR patented their software in 1968. To stop sharing of their program, they provided it under an equipment lease in which payment was spread over the lifetime of the product. ADR thus retained ownership and could control resale and reuse.
pl: Model ten zmienił się w latach 60. W 1965 roku ADR opracował pierwszy licencjonowany produkt programowy niezależny od firmy sprzętowej. ADR konkurował z darmowym pakietem IBM, opracowanym pierwotnie przez klientów IBM. ADR opatentował swoje oprogramowanie w 1968 roku. Aby uniemożliwić dzielenie się swoim programem, udostępniła go w formie leasingu sprzętu, w którym płatność była rozłożona na cały okres użytkowania produktu. ADR zachował w ten sposób własność i mógł kontrolować odsprzedaż i ponowne wykorzystanie.

source: In 1969 the US Department of Justice charged IBM with destroying businesses by bundling free software with IBM hardware. As a result of this suit, IBM unbundled its software; that is, software became independent products separate from hardware.
pl: W 1969 roku Departament Sprawiedliwości USA oskarżył IBM o niszczenie firm poprzez dołączanie wolnego oprogramowania do sprzętu IBM. W wyniku tego pozwu IBM uwolnił swoje oprogramowanie, to znaczy oprogramowanie stało się niezależnym produktem, oddzielonym od sprzętu.

source: In 1968 Informatics introduced the first commercial killer-app and rapidly established the concept of the software product, the software company, and very high rates of return. Informatics developed the perpetual license which is now standard throughout the computer industry, wherein ownership is never transferred to the customer.
pl: W 1968 roku Informatics wprowadził pierwszy komercyjny "killer-app" i szybko ustanowił pojęcie produktu oprogramowania, firmy oprogramowania i bardzo wysokie stopy zwrotu. Informatics opracował wieczystą licencję, która jest obecnie standardem w całym przemyśle komputerowym, gdzie własność nigdy nie jest przekazywana klientowi.

source: Unix from a BSD Licensing Perspective
pl: Unix z punktu widzenia licencji BSD

source: AT&T, who owned the original Unix implementation, was a publicly regulated monopoly tied up in anti-trust court; it was legally unable to sell a product into the software market. It was, however, able to provide it to academic institutions for the price of media.
pl: AT&T, która była właścicielem oryginalnej implementacji Uniksa, była publicznie regulowanym monopolem uwiązanym w sądzie antymonopolowym; prawnie nie mogła sprzedawać produktu na rynku oprogramowania. Mogła jednak dostarczać go instytucjom akademickim za cenę mediów.

source: Universities rapidly adopted Unix after an OS conference publicized its availability. It was extremely helpful that Unix ran on the PDP-11, a very affordable 16-bit computer, and was coded in a high-level language that was demonstrably good for systems programming. The DEC PDP-11 had, in effect, an open hardware interface designed to make it easy for customers to write their own OS, which was common. As DEC founder Ken Olsen famously proclaimed, "software comes from heaven when you have good hardware".
pl: Uniwersytety szybko przyjęły Uniksa po tym, jak na konferencji poświęconej systemom operacyjnym ogłoszono jego dostępność. Niezwykle pomocne było to, że Unix działał na PDP-11, bardzo przystępnym 16-bitowym komputerze, i był zakodowany w języku wysokiego poziomu, który był ewidentnie dobry do programowania systemów. DEC PDP-11 miał w efekcie otwarty interfejs sprzętowy, zaprojektowany tak, by ułatwić klientom pisanie własnych systemów operacyjnych, co było powszechne. Jak słynnie ogłosił założyciel DEC Ken Olsen, "oprogramowanie przychodzi z nieba, gdy masz dobry sprzęt".

source: Unix author Ken Thompson returned to his alma mater, University of California Berkeley (UCB), in 1975 and taught the kernel line-by-line. This ultimately resulted in an evolving system known as BSD (Berkeley Standard Distribution). UCB converted Unix to 32-bits, added virtual memory, and implemented the version of the TCP/IP stack upon which the Internet was essentially built. UCB made BSD available for the cost of media, under what became known as "the BSD license". A customer purchased Unix from AT&T and then ordered a BSD tape from UCB.
pl: Twórca Uniksa Ken Thompson powrócił do swojej macierzystej uczelni, Uniwersytetu Kalifornijskiego w Berkeley (UCB), w 1975 roku i uczył o jądrze linia po linii. W efekcie powstał ewoluujący system znany jako BSD (Berkeley Standard Distribution). UCB przekształciło Uniksa w system 32-bitowy, dodało pamięć wirtualną i zaimplementowało wersję stosu TCP/IP, na którym zasadniczo zbudowano Internet. UCB udostępniło BSD za cenę nośnika, na zasadzie znanej jako "licencja BSD". Klient kupował Unixa od AT&T, a następnie zamawiał taśmę BSD od UCB.

source: In the mid-1980s a government anti-trust case against AT&T ended with the break-up of AT&T. AT&T still owned Unix and was now able to sell it. AT&T embarked on an aggressive licensing effort and most commercial Unixes of the day became AT&T-derived.
pl: W połowie lat 80. rządowa sprawa antymonopolowa przeciwko AT&T zakończyła się rozpadem AT&T. AT&T nadal była właścicielem Uniksa i mogła go teraz sprzedawać. AT&T rozpoczęło agresywne działania licencyjne i większość komercyjnych Uniksów tamtego okresu stała się pochodną AT&T.

source: In the early 1990's AT&T sued UCB over license violations related to BSD. UCB discovered that AT&T had incorporated, without acknowledgment or payment, many improvements due to BSD into AT&T's products, and a lengthy court case, primarily between AT&T and UCB, ensued. During this period some UCB programmers embarked on a project to rewrite any AT&T code associated with BSD. This project resulted in a system called BSD 4.4-lite (lite because it was not a complete system; it lacked 6 key AT&T files).
pl: Na początku lat 90-tych AT&T pozwało UCB w związku z naruszeniem licencji związanych z BSD. UCB odkryło, że AT&T włączyło, bez uznania lub zapłaty, wiele ulepszeń wynikających z BSD do produktów AT&T, i w związku z tym rozpoczęła się długa sprawa sądowa, głównie pomiędzy AT&T i UCB. W tym okresie niektórzy programiści UCB rozpoczęli projekt mający na celu przepisanie wszelkich kodów AT&T związanych z BSD. W wyniku tego projektu powstał system nazwany BSD 4.4-lite (lite, ponieważ nie był to kompletny system; brakowało w nim 6 kluczowych plików AT&T).

source: A lengthy series of articles published slightly later in Dr. Dobbs magazine described a BSD-derived 386 PC version of Unix, with BSD-licensed replacement files for the 6 missing 4.4 lite files. This system, named 386BSD, was due to ex-UCB programmer William Jolitz. It became the original basis of all the PC BSDs in use today.
pl: Długa seria artykułów opublikowanych nieco później w magazynie Dr Dobbs opisywała pochodzącą z BSD wersję Uniksa na 386 PC, z licencjonowanymi przez BSD plikami zastępującymi brakujące pliki 6.4.4 lite. System ten, nazwany 386BSD, zawdzięczamy byłemu programiście z UCB Williamowi Jolitzowi. Stał się on pierwotną podstawą wszystkich używanych dziś systemów BSD.

source: In the mid 1990s, Novell purchased AT&T's Unix rights and a (then secret) agreement was reached to terminate the lawsuit. UCB soon terminated its support for BSD.
pl: W połowie lat 90. Novell zakupił prawa AT&T do Uniksa i zawarto (wówczas tajne) porozumienie o zakończeniu procesu sądowego. UCB wkrótce zakończyło swoje wsparcie dla BSD.

source: The Current State of FreeBSD and BSD Licenses
pl: Obecny stan FreeBSD i licencji BSD

source: The so-called http://www.opensource.org/licenses/bsd-license.php[new BSD license] applied to FreeBSD within the last few years is effectively a statement that you can do anything with the program or its source, but you do not have any warranty and none of the authors has any liability (basically, you cannot sue anybody). This new BSD license is intended to encourage product commercialization. Any BSD code can be sold or included in proprietary products without any restrictions on the availability of your code or your future behavior.
pl: Tak zwana http://www.opensource.org/licenses/bsd-license.php[nowa licencja BSD] zastosowana do FreeBSD w ciągu ostatnich kilku lat jest efektywnie stwierdzeniem, że możesz zrobić wszystko z programem lub jego źródłem, ale nie masz żadnej gwarancji i żaden z autorów nie ponosi żadnej odpowiedzialności (w zasadzie nie możesz nikogo pozwać). Nowa licencja BSD ma zachęcać do komercjalizacji produktów. Każdy kod BSD może być sprzedawany lub włączany do produktów własnościowych bez żadnych ograniczeń dotyczących dostępności waszego kodu lub waszego przyszłego zachowania.

source: Do not confuse the new BSD license with "public domain". While an item in the public domain is also free for all to use, it has no owner.
pl: Nie należy mylić nowej licencji BSD z "domeną publiczną". Podczas gdy przedmiot w domenie publicznej jest również wolny do użytku dla wszystkich, nie ma on właściciela.

source: The origins of the GPL
pl: Geneza licencji GPL

source: While the future of Unix had been so muddled in the late 1980s and early 1990s, the GPL, another development with important licensing considerations, reached fruition.
pl: Podczas gdy przyszłość Uniksa była tak zamglona w późnych latach 80. i wczesnych 90. Licencja GPL osiągnęła sukces.

source: Richard Stallman, the developer of Emacs, was a member of the staff at MIT when his lab switched from home-grown to proprietary systems. Stallman became upset when he found that he could not legally add minor improvements to the system. (Many of Stallman's co-workers had left to form two companies based on software developed at MIT and licensed by MIT; there appears to have been disagreement over access to the source code for this software). Stallman devised an alternative to the commercial software license and called it the GPL, or "GNU Public License". He also started a non-profit foundation, the http://www.fsf.org[Free Software Foundation] (FSF), which intended to develop an entire operating system, including all associated software, that would not be subject to proprietary licensing. This system was called GNU, for "GNU is Not Unix".
pl: Richard Stallman, twórca Emacsa, był pracownikiem MIT, gdy jego laboratorium przestawiło się z systemów domowych na własnościowe. Stallman zdenerwował się, gdy odkrył, że nie może legalnie dodawać drobnych poprawek do systemu. (Wielu współpracowników Stallmana odeszło, by stworzyć dwie firmy oparte na oprogramowaniu stworzonym na MIT i licencjonowanym przez MIT; wydaje się, że nie było zgody co do dostępu do kodu źródłowego tego oprogramowania). Stallman opracował alternatywę dla komercyjnej licencji oprogramowania i nazwał ją GPL, czyli "GNU Public License". Założył również fundację non-profit, http://www.fsf.org[Free Software Foundation] (FSF), która zamierzała opracować cały system operacyjny, wraz z całym towarzyszącym mu oprogramowaniem, który nie podlegałby prawnie zastrzeżonym licencjom. System ten nazwano GNU, od "GNU is Not Unix".

source: The GPL was designed to be the antithesis of the standard proprietary license. To this end, any modifications that were made to a GPL program were required to be given back to the GPL community (by requiring that the source of the program be available to the user) and any program that used or linked to GPL code was required to be under the GPL. The GPL was intended to keep software from becoming proprietary. As the last paragraph of the GPL states:
pl: GPL została zaprojektowana jako antyteza standardowej licencji własnościowej. W tym celu, wszelkie modyfikacje dokonane w programie na licencji GPL musiały być oddane społeczności GPL (poprzez wymóg udostępnienia źródła programu użytkownikowi), a każdy program, który używał lub łączył się z kodem GPL, musiał być na licencji GPL. Licencja miała na celu powstrzymanie oprogramowania przed staniem się prawnie zastrzeżonym. Jak stwierdza ostatni paragraf GPL:

source: "This General Public License does not permit incorporating your program into proprietary programs."<<one>>
pl: "Niniejsza Ogólna Licencja Publiczna nie zezwala na włączenie twojego programu do programów własnościowych."<<one>>

source: The http://www.opensource.org/licenses/gpl-license.php[GPL] is a complex license so here are some rules of thumb when using the GPL:
pl: http://www.opensource.org/licenses/gpl-license.php[GPL] jest złożoną licencją, więc oto kilka zasad, którymi należy się kierować przy korzystaniu z GPL:

source: you can charge as much as you want for distributing, supporting, or documenting the software, but you cannot sell the software itself.
pl: możecie pobierać dowolne opłaty za dystrybucję, wsparcie lub dokumentację oprogramowania, ale nie możecie sprzedawać samego oprogramowania.

source: the rule-of-thumb states that if GPL source is required for a program to compile, the program must be under the GPL. Linking statically to a GPL library requires a program to be under the GPL.
pl: jeśli źródło GPL jest wymagane do skompilowania programu, to program musi być na GPL. Linkowanie statyczne do biblioteki GPL wymaga, by program był na licencji GPL.

source: the GPL requires that any patents associated with GPLed software must be licensed for everyone's free use.
pl: GPL wymaga, by wszelkie patenty związane z oprogramowaniem na licencji GPL były licencjonowane do swobodnego użytku przez wszystkich.

source: simply aggregating software together, as when multiple programs are put on one disk, does not count as including GPLed programs in non-GPLed programs.
pl: zwykłe łączenie oprogramowania razem, jak w przypadku umieszczenia wielu programów na jednym dysku, nie liczy się jako włączenie programów GPL do programów nieobjętych GPL-elem.

source: output of a program does not count as a derivative work. This enables the gcc compiler to be used in commercial environments without legal problems.
pl: wyjście z programu nie liczy się jako praca pochodna. Dzięki temu kompilator gcc może być używany w środowiskach komercyjnych bez problemów prawnych.

source: since the Linux kernel is under the GPL, any code statically linked with the Linux kernel must be GPLed. This requirement can be circumvented by dynamically linking loadable kernel modules. This permits companies to distribute binary drivers, but often has the disadvantage that they will only work for particular versions of the Linux kernel.
pl: ponieważ jądro Linuksa jest na licencji GPL, każdy kod statycznie połączony z jądrem Linuksa musi być na licencji GPL. Wymóg ten można obejść poprzez dynamiczne łączenie ładowalnych modułów jądra. Pozwala to firmom na dystrybucję binarnych sterowników, ale często ma tę wadę, że będą one działać tylko dla określonych wersji jądra Linux.

source: Due in part to its complexity, in many parts of the world today the legalities of the GPL are being ignored in regard to Linux and related software. The long-term ramifications of this are unclear.
pl: Po części z powodu jej złożoności, w wielu częściach świata obecnie legalność GPL jest ignorowana w odniesieniu do Linuksa i pokrewnego oprogramowania. Długoterminowe konsekwencje tego są niejasne.

source: The origins of Linux and the LGPL
pl: Geneza Linuksa i licencji LGPL

source: While the commercial Unix wars raged, the Linux kernel was developed as a PC Unix clone. Linus Torvalds credits the existence of the GNU C compiler and the associated GNU tools for the existence of Linux. He put the Linux kernel under the GPL.
pl: Podczas gdy trwały wojny o komercyjnego Uniksa, jądro Linuksa było rozwijane jako klon Uniksa dla personalnych komputerów. Linus Torvalds przypisuje istnienie kompilatora GNU C i związanych z nim narzędzi GNU istnieniu Linuksa. Umieścił on jądro Linuksa na licencji GPL.

source: Remember that the GPL requires anything that statically links to any code under the GPL also be placed under the GPL. The source for this code must thus be made available to the user of the program. Dynamic linking, however, is not considered a violation of the GPL. Pressure to put proprietary applications on Linux became overwhelming. Such applications often must link with system libraries. This resulted in a modified version of the GPL called the http://www.opensource.org/licenses/lgpl-license.php[LGPL] ("Library", since renamed to "Lesser", GPL). The LGPL allows proprietary code to be linked to the GNU C library, glibc. You do not have to release the source code which has been dynamically linked to an LGPLed library.
pl: Pamiętaj, że GPL wymaga, aby wszystko, co statycznie łączy się z jakimkolwiek kodem na GPL, również było objęte GPL. Źródło tego kodu musi być zatem udostępnione użytkownikowi programu. Dynamiczne łączenie nie jest jednak uznawane za naruszenie GPL. Presja na umieszczanie własnościowych aplikacji na Linuksie stała się przytłaczająca. Takie aplikacje często muszą łączyć się z bibliotekami systemowymi. Doprowadziło to do powstania zmodyfikowanej wersji GPL zwanej http://www.opensource.org/licenses/lgpl-license.php[LGPL] ("Library", od czasu zmiany nazwy na "Lesser", GPL). LGPL pozwala na łączenie zastrzeżonego kodu z biblioteką GNU C, glibc. Nie musicie wydawać kodu źródłowego, który został dynamicznie połączony z biblioteką na licencji LGPL.

source: If you statically link an application with glibc, such as is often required in embedded systems, you cannot keep your application proprietary, that is, the source must be released. Both the GPL and LGPL require any modifications to the code directly under the license to be released.
pl: Jeśli statycznie łączysz aplikację z glibc, co jest często wymagane w systemach wbudowanych, nie możesz zachować swojej aplikacji jako zastrzeżonej, to znaczy, że źródło musi zostać wydane. Zarówno GPL, jak i LGPL wymagają, by wszelkie modyfikacje kodu dokonywane bezpośrednio pod licencją były udostępniane.

source: Open Source licenses and the Orphaning Problem
pl: Licencje Otwarto Źródłowa i problem osierocenia

source: One of the serious problems associated with proprietary software is known as "orphaning". This occurs when a single business failure or change in a product strategy causes a huge pyramid of dependent systems and companies to fail for reasons beyond their control. Decades of experience have shown that the momentary size or success of a software supplier is no guarantee that their software will remain available, as current market conditions and strategies can change rapidly.
pl: Jeden z poważnych problemów związanych z oprogramowaniem własnościowym znany jest jako "osierocenie". Dzieje się tak, gdy pojedyncza porażka biznesowa lub zmiana strategii produktu powoduje, że ogromna piramida zależnych systemów i firm upada z przyczyn od nich niezależnych. Dziesięciolecia doświadczeń pokazały, że chwilowa wielkość lub sukces dostawcy oprogramowania nie jest gwarancją, że jego oprogramowanie pozostanie dostępne, ponieważ aktualne warunki rynkowe i strategie mogą się szybko zmienić.

source: The GPL attempts to prevent orphaning by severing the link to proprietary intellectual property.
pl: GPL próbuje zapobiec osieroceniu poprzez zerwanie powiązania z prawnie zastrzeżoną własnością intelektualną.

source: A BSD license gives a small company the equivalent of software-in-escrow without any legal complications or costs. If a BSD-licensed program becomes orphaned, a company can simply take over, in a proprietary manner, the program on which they are dependent. An even better situation occurs when a BSD code-base is maintained by a small informal consortium, since the development process is not dependent on the survival of a single company or product line. The survivability of the development team when they are mentally in the zone is much more important than simple physical availability of the source code.
pl: Licencja BSD daje małej firmie odpowiednik oprogramowania w depozycie bez żadnych prawnych komplikacji i kosztów. Jeżeli program na licencji BSD zostanie osierocony, firma może po prostu przejąć, w sposób zastrzeżony, program, od którego jest zależna. Jeszcze lepsza sytuacja ma miejsce, gdy baza kodu BSD jest utrzymywana przez małe nieformalne konsorcjum, ponieważ proces rozwoju nie jest zależny od przetrwania pojedynczej firmy lub linii produktów. Przetrwanie zespołu programistów jest znacznie ważniejsze niż prosta fizyczna dostępność kodu źródłowego.

source: What a license cannot do
pl: Czego licencja nie może zrobić

source: No license can guarantee future software availability. Although a copyright holder can traditionally change the terms of a copyright at anytime, the presumption in the BSD community is that such an attempt simply causes the source to fork.
pl: Żadna licencja nie może zagwarantować przyszłej dostępności oprogramowania. Chociaż posiadacz praw autorskich może tradycyjnie zmienić ich warunki w dowolnym momencie, założenie w społeczności BSD jest takie, że taka próba powoduje po prostu rozwidlenie (fork) źródła.
