Repository: cygnus6960/freebsd-doc-ko
Catalog: documentation/content/*/articles/bsdl-gpl/_index.po
Languages: pl

source: In addition, since the BSD license does not come with the legal complexity of the GPL or LGPL licenses, it allows developers and companies to spend their time creating and promoting good code rather than worrying if that code violates licensing.
pl: Ponadto, ponieważ licencja BSD nie wiąże się ze złożonością prawną licencji GPL lub LGPL, pozwala programistom i firmom poświęcić swój czas na tworzenie i promowanie dobrego kodu, a nie na martwienie się, czy kod ten nie narusza licencji.

source: Bibliographical References
pl: Bibliografia

source: This whitepaper is a condensation of an original work available at http://alumni.cse.ucsc.edu/~brucem/open_source_license.htm
pl: Niniejszy artykuł jest kondensacją oryginalnej pracy dostępnej pod adresem http://alumni.cse.ucsc.edu/~brucem/open_source_license.htm
