Repository: cygnus6960/freebsd-doc-ko
Catalog: documentation/content/*/books/fdp-primer/preface/_index.po
Languages: it_it

source: Preface about the FreeBSD Documentation Project
it_it: Prefazione del FreeBSD Documentation Project

source: Preface
it_it: Prefazione

source: Shell Prompts
it_it: Prompt delle Shell

source: This table shows the default system prompt and superuser prompt. The examples use these prompts to indicate which type of user is running the example.
it_it: Questa tabella mostra il prompt di sistema di default e il prompt del superutente. Gli esempi usano questi prompt per indicare quale tipo di utente sta eseguendo l'esempio.

source: User
it_it: Utente

source: Normal user
it_it: Utente normale

source: Typographic Conventions
it_it: Convenzioni Tipografiche

source: This table describes the typographic conventions used in this book.
it_it: Questa tabella descrive le convenzioni tipografiche usate in questo libro.

source: Meaning
it_it: Significato

source: Examples
it_it: Esempi

source: The names of commands.
it_it: I nomi dei comandi.

source: Use `ls -l` to list all files.
it_it: Usare `ls -l` per elencare tutti i file.

source: The names of files.
it_it: I nomi dei file.

source: Edit [.filename]#.login#.
it_it: Modificare [.filename]#.login#.

source: On-screen computer output.
it_it: Output a schermo.

source: What the user types, contrasted with on-screen computer output.
it_it: Quanto digitato dall'utente, distinto dall'output a schermo.

source: Manual page references.
it_it: Riferimenti a pagine di manuale.

source: Use man:su[1] to change user identity.
it_it: Usare man:su[1] per cambiare l'identità dell'utente.

source: User and group names.
it_it: Nomi di utenti e gruppi.

source: Only `root` can do this.
it_it: Solo `root` può fare questo.

source: Emphasis.
it_it: Enfasi.

source: The user _must_ do this.
it_it: L'utente _deve_ far questo.

source: Text that the user is expected to replace with the actual text.
it_it: Testo da sostituire da parte dell'utente.

source: To search for a keyword in the manual pages, type `man -k _keyword_`
it_it: Per cercare una parola chiave nelle pagine di manuale, si digiti `man -k _parola chiave_`

source: Environment variables.
it_it: Variabili dell'environment.

source: `$HOME` is set to the user's home directory.
it_it: `$HOME` ha il valore della directory home dell'utente.

source: Notes, Tips, Important Information, Warnings, and Examples
it_it: Note, Consigli, Informazioni Importanti, Avvertimenti ed Esempi

source: Notes, warnings, and examples appear within the text.
it_it: Compaiono note, avvisi ed esempi all'interno del testo.

source: Notes are represented like this, and contain information to take note of, as it may affect what the user does.
it_it: Le note sono rappresentate così e contengono informazioni da tener ben presenti, in quanto potrebbero influenzare le azioni dell'utente.

source: Tips are represented like this, and contain information helpful to the user, such as showing an easier way to do something.
it_it: I suggerimenti sono rappresentati così e contengono informazioni utili all'utente, come illustrare un modo più semplice di fare qualcosa.

source: Important information is represented like this. Typically, these show extra steps the user may need to take.
it_it: Informazioni importanti sono rappresentate così. Tipicamente, queste mostrano passaggi ulteriori che l'utente potrebbe aver bisogno di seguire.

source: Warnings are represented like this, and contain information warning about possible damage if the instructions are not followed. This damage may be physical, to the hardware or the user, or it may be non-physical, such as the inadvertent deletion of important files.
it_it: Gli avvisi sono rappresentati così e contengono avvertenze su eventuali danni nel caso le istruzioni non venissero seguite. Questi danni possono essere fisici, all'hardware o all'utente, o non fisici, come la rimozione involontaria di file importanti.

source: A Sample Example
it_it: Un Esempio

source: Examples are represented like this, and typically contain examples showing a walkthrough, or the results of a particular action.
it_it: Gli esempi sono rappresentati così e contengono solitamente esempi passo passo o i risultati di un'azione particolare.

source: Acknowledgments
it_it: Riconoscimenti

source: My thanks to Sue Blake, Patrick Durusau, Jon Hamilton, Peter Flynn, and Christopher Maden, who took the time to read early drafts of this document and offer many valuable comments and criticisms.
it_it: I miei ringrazimenti vanno a Sue Blake, Patrick Durusau, Jon Hamilton, Peter Flynn e Christopher Maden, che hanno impiegato il loro tempo per leggere le prime bozze di questo documento e fornire tanti utili commenti e critiche costruttive.
